In [35]:
import pandas as pd
import numpy as np
ser = pd.Series([0,1,np.nan,"Hello",complex(3,2)])
ser
# in Series we can't add or remove data

0         0
1         1
2       NaN
3     Hello
4    (3+2j)
dtype: object

In [36]:
data = {"Name":["Sasi1","Kala1","Rama1"],"Age":[12,44,78],"Profession":["dsfsd","dasfd","sdad"] }
data

{'Name': ['Sasi', 'Kala', 'Rama'],
 'Age': [12, 44, 78],
 'Profession': ['dsfsd', 'dasfd', 'sdad']}

In [37]:
# Shift +enter for run,tab for autocompletion
df = pd.DataFrame(data)
df

   Name  Age Profession
0  Sasi   12      dsfsd
1  Kala   44      dasfd
2  Rama   78       sdad

In [38]:
for index, row in df.iterrows():
    print(index, ":", row)

0 : Name           Sasi
Age              12
Profession    dsfsd
Name: 0, dtype: object
1 : Name           Kala
Age              44
Profession    dasfd
Name: 1, dtype: object
2 : Name          Rama
Age             78
Profession    sdad
Name: 2, dtype: object

In [39]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Sasi', Age=12, Profession='dsfsd')
Pandas(Index=1, Name='Kala', Age=44, Profession='dasfd')
Pandas(Index=2, Name='Rama', Age=78, Profession='sdad')

In [40]:
df.Age.apply(np.sqrt)

0    3.464102
1    6.633250
2    8.831761
Name: Age, dtype: float64

In [41]:
lst = pd.MultiIndex.from_frame(df)
lst

MultiIndex([('Sasi', 12, 'dsfsd'),
            ('Kala', 44, 'dasfd'),
            ('Rama', 78,  'sdad')],
           names=['Name', 'Age', 'Profession'])

In [42]:
lst[0][0]

'Sasi'

In [43]:
lst[-1][-1]

'sdad'

In [44]:
df.reindex([2,1,0])

   Name  Age Profession
2  Rama   78       sdad
1  Kala   44      dasfd
0  Sasi   12      dsfsd

In [45]:
data2 = {"Name":["asda","sdfdd","fsfds"],"Age":[12,44,78],"Martialst":["dsfsd","dasfd","sdad"] }
df2 = pd.DataFrame(data2)
df2

    Name  Age Martialst
0   asda   12     dsfsd
1  sdfdd   44     dasfd
2  fsfds   78      sdad

In [46]:
newdf = df.merge(df2,on = "Name")
newdf

Empty DataFrame
Columns: [Name, Age_x, Profession, Age_y, Martialst]
Index: []

In [47]:
newdf2 = pd.concat([df,df2],axis=1)
newdf2

   Name  Age Profession   Name  Age Martialst
0  Sasi   12      dsfsd   asda   12     dsfsd
1  Kala   44      dasfd  sdfdd   44     dasfd
2  Rama   78       sdad  fsfds   78      sdad

In [48]:
newdf2 = pd.concat([df,df2],axis=0)
newdf2

    Name  Age Profession Martialst
0   Sasi   12      dsfsd       NaN
1   Kala   44      dasfd       NaN
2   Rama   78       sdad       NaN
0   asda   12        NaN     dsfsd
1  sdfdd   44        NaN     dasfd
2  fsfds   78        NaN      sdad

In [49]:
data2 = {"Name":["asda","sdfdd","fsfds"],"Age":[12,44,78],"Martialst":["Yes","Yes","No"] }
df2 = pd.DataFrame(data2)
df2

    Name  Age Martialst
0   asda   12       Yes
1  sdfdd   44       Yes
2  fsfds   78        No

In [50]:
df2["Martialst"] = df2["Martialst"].map({"Yes":1,"No":0})
df2

    Name  Age  Martialst
0   asda   12          1
1  sdfdd   44          1
2  fsfds   78          0

In [51]:
data2 = {"Name":["asda","sdfdd","fsfds"],"Age":[12,44,78],"Martialst":["Yes","Yes","No"],"Profession":["asdadh","sdfddg","fsf"] }
df

   Name  Age Profession
0  Sasi   12      dsfsd
1  Kala   44      dasfd
2  Rama   78       sdad

In [52]:
 df[["Name","Profession"]].applymap(lambda x: len(x))

C:\Users\Manasvi\AppData\Local\Temp\ipykernel_904\1887373491.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df[["Name","Profession"]].applymap(lambda x: len(x))

   Name  Profession
0     4           5
1     4           5
2     4           4

In [53]:
df[["Name","Profession"]].apply(lambda x: len(x), axis = 0)

Name          3
Profession    3
dtype: int64

In [54]:
df["Profession"] = pd.Categorical(df["Profession"]).codes
df

   Name  Age  Profession
0  Sasi   12           1
1  Kala   44           0
2  Rama   78           2

In [55]:
dummy = pd.get_dummies(df,columns =["Profession"],dtype = int)

In [56]:
df.Age.mean()

44.666666666666664

In [57]:
mask = df["Profession"]== "sdad"
mask

0    False
1    False
2    False
Name: Profession, dtype: bool

#Vectorized operations in pandas apply a function to an entire array or column at once, rather than iterating through individual elements using Python loops. This approach leverages highly optimized, pre-compiled C and Fortran code (via the underlying NumPy library), resulting in significantly faster and cleaner code, especially for large datasets. 
Vectorized operations are dramatically faster than explicit Python loops (including for loops, iterrows(), and often apply())

In [59]:

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
# Vectorized addition
df['C'] = df['A'] + df['B']
# Other operations like subtraction, multiplication, division also work
df['D'] = df['A'] * df['B']
df

   A  B  C   D
0  1  4  5   4
1  2  5  7  10
2  3  6  9  18

In [60]:
Calculate the mean of a column
mean_value = df['A'].mean()
# Other functions like median, sum, std, min, max are also vectorized
max_value = df['B'].max()

SyntaxError: invalid syntax (1393741573.py, line 1)

In [ ]:
import numpy as np
# Create a new column 'Category' based on a condition
df['Category'] = np.where(df['A'] > 2, 'High', 'Low')
df

In [ ]:
# Boolean indexing
filtered_df = df[df['A'] > 1]
filtered_df

In [ ]:
# Create a sample DataFrame with missing values
df = pd.DataFrame({'A': [1, 2, np.nan, 4, 5],
                   'B': [6, np.nan, np.nan, 9, 10],
                   'C': [np.nan, 1, 2, np.nan, 3]})

print("Original DataFrame:")
print(df)

# Fill missing values using default linear interpolation
df_linear = df.interpolate()
print("\nDataFrame after linear interpolation:")
print(df_linear)

In [ ]:
s=pd.Series([0,1,2,np.nan,4,5])
s.interpolate()

In [ ]:
s.fillna(0)